bloknayrb/Clawdmeter/firmware/sdkconfig.defaults
# Clawdmeter sdkconfig defaults — ESP32-C6-Touch-AMOLED-1.47

# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash — 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# Power management — DFS scales CPU 160→80 MHz when idle; auto light-sleep
# kicks in during long vTaskDelay windows. Cuts idle current sharply.
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# BLE controller modem sleep (lets the radio sleep between connection events)
CONFIG_BT_LE_SLEEP_ENABLE=y
# Required by BT controller when BT_LE_SLEEP_ENABLE + tickless idle are on —
# powers down MAC + baseband during PHY-disabled windows. Costs ~2 KB RAM.
CONFIG_ESP_PHY_MAC_BB_PD=y

# LVGL (added here so managed_components resolves on first build;
# not wired into REQUIRES until Phase 2)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_DISP_DEF_REFR_PERIOD=33
CONFIG_LV_USE_OS=y
CONFIG_LV_OS_FREERTOS=y

# Console — USB Serial/JTAG (C6 ships with this interface; no UART adapter needed)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# Keep USB active during light sleep so serial doesn't drop during debugging
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Bluetooth — NimBLE peripheral-only (Phase 3+)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y
